; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	satellite1 - satellite
	instrument2 - instrument
	instrument3 - instrument
	instrument4 - instrument
	instrument5 - instrument
	satellite2 - satellite
	instrument6 - instrument
	instrument7 - instrument
	instrument8 - instrument
	instrument9 - instrument
	image2 - mode
	image0 - mode
	image1 - mode
	Star12 - direction
	Star13 - direction
	GroundStation4 - direction
	GroundStation11 - direction
	GroundStation2 - direction
	Star7 - direction
	Star0 - direction
	GroundStation14 - direction
	GroundStation5 - direction
	GroundStation10 - direction
	Star9 - direction
	Star8 - direction
	GroundStation1 - direction
	Star3 - direction
	GroundStation6 - direction
	Star15 - direction
	Phenomenon16 - direction
	Phenomenon17 - direction
	Planet18 - direction
)
(:init
	(supports instrument0 image2)
	(calibration_target instrument0 Star0)
	(calibration_target instrument0 GroundStation10)
	(calibration_target instrument0 GroundStation5)
	(supports instrument1 image1)
	(supports instrument1 image2)
	(supports instrument1 image0)
	(calibration_target instrument1 GroundStation14)
	(calibration_target instrument1 GroundStation6)
	(calibration_target instrument1 GroundStation2)
	(calibration_target instrument1 Star9)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 GroundStation11)
	(supports instrument2 image1)
	(supports instrument2 image2)
	(calibration_target instrument2 Star8)
	(calibration_target instrument2 GroundStation14)
	(calibration_target instrument2 GroundStation10)
	(calibration_target instrument2 GroundStation5)
	(calibration_target instrument2 Star9)
	(supports instrument3 image2)
	(supports instrument3 image1)
	(supports instrument3 image0)
	(calibration_target instrument3 Star3)
	(calibration_target instrument3 GroundStation5)
	(calibration_target instrument3 GroundStation4)
	(supports instrument4 image2)
	(supports instrument4 image0)
	(calibration_target instrument4 GroundStation11)
	(supports instrument5 image2)
	(supports instrument5 image1)
	(supports instrument5 image0)
	(calibration_target instrument5 Star7)
	(calibration_target instrument5 GroundStation2)
	(on_board instrument2 satellite1)
	(on_board instrument3 satellite1)
	(on_board instrument4 satellite1)
	(on_board instrument5 satellite1)
	(power_avail satellite1)
	(pointing satellite1 GroundStation4)
	(supports instrument6 image2)
	(supports instrument6 image0)
	(calibration_target instrument6 GroundStation14)
	(calibration_target instrument6 Star8)
	(calibration_target instrument6 GroundStation1)
	(calibration_target instrument6 Star0)
	(supports instrument7 image1)
	(supports instrument7 image0)
	(supports instrument7 image2)
	(calibration_target instrument7 Star9)
	(supports instrument8 image2)
	(supports instrument8 image0)
	(calibration_target instrument8 GroundStation10)
	(calibration_target instrument8 GroundStation5)
	(supports instrument9 image1)
	(supports instrument9 image0)
	(supports instrument9 image2)
	(calibration_target instrument9 GroundStation6)
	(calibration_target instrument9 Star3)
	(calibration_target instrument9 GroundStation1)
	(calibration_target instrument9 Star8)
	(calibration_target instrument9 Star9)
	(on_board instrument6 satellite2)
	(on_board instrument7 satellite2)
	(on_board instrument8 satellite2)
	(on_board instrument9 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Star15)
)
(:goal (and
	(have_image Star15 image0)
	(have_image Phenomenon16 image2)
	(have_image Phenomenon17 image0)
	(have_image Planet18 image0)
))

)

; plan
1. (switch_on instrument3 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument3)
   goals met: 0 of 4
2. (calibrate satellite1 instrument3 groundstation4)
   added: (calibrated instrument3)
   goals met: 0 of 4
3. (turn_to satellite1 phenomenon17 groundstation4)
   deleted: (pointing satellite1 groundstation4)
   added: (pointing satellite1 phenomenon17)
   goals met: 0 of 4
4. (take_image satellite1 phenomenon17 instrument3 image0)
   added: (have_image phenomenon17 image0)
   goals met: 1 of 4
5. (turn_to satellite1 phenomenon16 phenomenon17)
   deleted: (pointing satellite1 phenomenon17)
   added: (pointing satellite1 phenomenon16)
   goals met: 1 of 4
6. (take_image satellite1 phenomenon16 instrument3 image2)
   added: (have_image phenomenon16 image2)
   goals met: 2 of 4
7. (turn_to satellite1 planet18 phenomenon16)
   deleted: (pointing satellite1 phenomenon16)
   added: (pointing satellite1 planet18)
   goals met: 2 of 4
8. (take_image satellite1 planet18 instrument3 image0)
   added: (have_image planet18 image0)
   goals met: 3 of 4
9. (turn_to satellite1 star15 planet18)
   deleted: (pointing satellite1 planet18)
   added: (pointing satellite1 star15)
   goals met: 3 of 4
10. (take_image satellite1 star15 instrument3 image0)
   added: (have_image star15 image0)
   goals met: 4 of 4
